HardenedBSD/hardenedBSD/usr.bin/nfs-exporter/doc/nfs-exporter.8
.\" Copyright (c) 2023 Axcient
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd February 21, 2023
.Dt NFS-EXPORTER 8
.Os
.Sh NAME
.Nm nfs-exporter
.Nd Export NFS statistics to Prometheus
.Sh SYNOPSIS
.Nm
.Op Fl Vhs
.Op Fl b Ar address
.Op Fl p Ar port
.Sh DESCRIPTION
Prometheus is a monitoring system that gathers metrics from its targets by
fetching them through HTTP GET requests.
Metrics are identified by a name and an optional set of labels.
Sample values are required to be numerical.
.Pp
The
.Nm
daemon publishes statistics from the
.Fx
NFS system via an HTTP server, in the correct format to be scraped by
Prometheus.
Its options are as follows:
.Bl -tag -width indent
.It Fl s
Publish statistics of the NFS server.
This is the default behavior.
.It Fl b , Fl Fl address Ar address
Bind to this local address.
By default,
.Nm
will bind to the wildcard address.
.It Fl p , Fl Fl port Ar port
Serve metrics on this TCP port.
The default is 9898.
.El
.Sh SEE ALSO
.Xr nfsstat 1
.Pp
Prometheus project:
.Pa https://prometheus.io/ .
.Pp
Prometheus exposition formats:
.Pa https://prometheus.io/docs/instrumenting/exposition_formats/ .
.Pp
Prometheus default port allocations:
.Pa https://github.com/prometheus/prometheus/wiki/Default-port-allocations .
